PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_smartcard.c
    case HAL_SMARTCARD_USER_CALLBCAK_STRUCT:
        /* initialize user callback structure with the default values */
        ((hal_smartcard_user_callback_struct *)p_struct)->complete_func = NULL;
        ((hal_smartcard_user_callback_struct *)p_struct)->error_func = NULL;
        break;

    case HAL_SMARTCARD_IRQ_INIT_STRUCT:
        /* initialize interrupt callback structure with the default values */
        ((hal_smartcard_irq_struct *)p_struct)->error_handle = NULL;
        ((hal_smartcard_irq_struct *)p_struct)->receive_complete_handle = NULL;
        ((hal_smartcard_irq_struct *)p_struct)->transmit_complete_handle = NULL;
        ((hal_smartcard_irq_struct *)p_struct)->transmit_ready_handle = NULL;
        break;

    default:
        HAL_DEBUGW("parameter [hal_struct_type] value is undefine");
        break;
    }
}

/*!
    \brief      deinitialize smartcard
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_smartcard_deinit(hal_smartcard_dev_struct *smartcard)
{
    uint32_t periph;
    periph = smartcard->periph;

    if((USART0 == periph)) {
        /* deinitialize the peripheral */
        hals_smartcard_deinit(periph);
        /* initialize smartcard extend initialization structure */
        hal_smartcard_struct_init(HAL_SMARTCARD_DEV_STRUCT, smartcard);
        smartcard->periph = periph;
    } else {
        HAL_DEBUGE("parameter [smartcard->periph] value is invalid");
    }
}

/*!
    \brief      initialize smartcard
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  periph: specify which SMARTCARD is initialized
                    this parameter can only be USART0 for gd32f3x0
    \param[in]  p_init: the initialization data needed to initialize smartcard
                  baudrate: communication baudrate
                  parity: SMARTCARD_PARITY_EVEN, SMARTCARD_PARITY_ODD
                  word_length: SMARTCARD_WORD_LENGTH_9BIT
                  stop_bit: SMARTCARD_STOP_BIT_0_5, SMARTCARD_STOP_BIT_1_5
                  direction: SMARTCARD_DIRECTION_RX_TX, SMARTCARD_DIRECTION_RX_ONLY, SMARTCARD_DIRECTION_TX_ONLY
                  clock_polarity: SMARTCARD_CLOCK_POLARITY_LOW, SMARTCARD_CLOCK_POLARITY_HIGH
                  clock_phase: SMARTCARD_CLOCK_PHASE_1CK, SMARTCARD_CLOCK_PHASE_2CK
                  clock_length_lastbit: SMARTCARD_LAST_BIT_NOT_OUTPUT, SMARTCARD_LAST_BIT_OUTPUT
                  prescaler: 2,4,6 - 62
                  guard_time: 0 - 255
                  nack_state: SMARTCARD_NACK_DISABLE, SMARTCARD_NACK_ENABLE
                  early_nack: DISABLE, ENABLE
                  rx_fifo_en: DISABLE, ENABLE
                  timeout_enable: DISABLE, ENABLE
                  timeout_value: 0 - (2^24-1)
                  sample_method: SMARTCARD_THREE_SAMPLE_BIT, SMARTCARD_ONE_SAMPLE_BIT
                  block_length: 0 - 255
                  auto_retry_count: 0 - 7
                  first_bit_msb: DISABLE, ENABLE
                  tx_rx_swap: DISABLE, ENABLE
                  rx_level_invert: DISABLE, ENABLE
                  tx_level_invert: DISABLE, ENABLE
                  data_bit_invert: DISABLE, ENABLE
                  overrun_disable: DISABLE, ENABLE
                  rx_error_dma_stop: DISABLE, ENABLE
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, details refer to gd32f3x0_hal.h
*/
int32_t hal_smartcard_init(hal_smartcard_dev_struct *smartcard, uint32_t periph, hal_smartcard_init_struct *p_init)
{
    uint32_t reg_temp;

#if (1U == HAL_PARAMETER_CHECK)
    /* check smartcard pointer and p_init address */
    if((NULL == smartcard) || (NULL == p_init)) {
        HAL_DEBUGE("pointer [smartcard] or [p_init] address is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* check periph parameter */
    if(USART0 != periph) {
        HAL_DEBUGE("parameter [periph] value is invalid");
        return HAL_ERR_VAL;
    }

    /* check periph value from smartcard device struct */
    if(0U != smartcard->periph) {
        HAL_DEBUGI("periph value from smartcard device struct has been rewrite");
    }
#endif /* 1U == HAL_PARAMETER_CHECK */

    /* lock smartcard */
    HAL_LOCK(smartcard);

    smartcard->periph   = periph;

    /* disable the peripheral */
    hals_smartcard_disable(periph);

    /* configure CTL0 register */
    reg_temp = USART_CTL0(periph);
    reg_temp &= ~(USART_CTL0_PM | USART_CTL0_PCEN | USART_CTL0_WL | USART_CTL0_OVSMOD | \
                  USART_CTL0_REN | USART_CTL0_TEN);
    reg_temp |= (p_init->direction | p_init->parity | p_init->word_length);
    USART_CTL0(periph) = reg_temp;

    /* configure CTL1 register */
    reg_temp = USART_CTL1(periph);
    reg_temp &= ~(USART_CTL1_RTEN | USART_CTL1_CLEN | USART_CTL1_CPH | USART_CTL1_CPL | \
                  USART_CTL1_CKEN | USART_CTL1_STB);
    /* Synchronous mode is activated by default */
    reg_temp |= (USART_CTL1_CKEN | p_init->clock_polarity | p_init->clock_phase | \
                 p_init->clock_length_lastbit | p_init->stop_bit);
    USART_CTL1(periph) = reg_temp;

    /* configure timeout enable */
    if(ENABLE == p_init->timeout_enable) {
        USART_CTL1(periph) |= USART_CTL1_RTEN;
    } else {
        USART_CTL1(periph) &= ~(USART_CTL1_RTEN);
    }
    /* configure data inversion */
    if(ENABLE == p_init->data_bit_invert) {
        USART_CTL1(periph) |= USART_CTL1_DINV;
    } else {
        USART_CTL1(periph) &= ~(USART_CTL1_DINV);
    }
    /* configure Rx pin active level inversion */
    if(ENABLE == p_init->rx_level_invert) {
        USART_CTL1(periph) |= USART_CTL1_RINV;
    } else {
        USART_CTL1(periph) &= ~(USART_CTL1_RINV);
    }
    /* configure Tx pin active level inversion */
    if(ENABLE == p_init->tx_level_invert) {
        USART_CTL1(periph) |= USART_CTL1_TINV;
    } else {
        USART_CTL1(periph) &= ~(USART_CTL1_TINV);
    }
    /* configure Rx/Tx pins swap */
    if(ENABLE == p_init->tx_rx_swap) {
        USART_CTL1(periph) |= USART_CTL1_STRP;
    } else {
        USART_CTL1(periph) &= ~(USART_CTL1_STRP);
    }
    /* configure MSB first on communication line */
    if(ENABLE == p_init->first_bit_msb) {
        USART_CTL1(periph) |= USART_CTL1_MSBF;
    } else {
        USART_CTL1(periph) &= ~(USART_CTL1_MSBF);
    }

    /* configure CTL2 register */
    reg_temp = USART_CTL2(periph);
    reg_temp &= ~(USART_CTL2_OSB | USART_CTL2_NKEN | USART_CTL2_SCRTNUM);
    reg_temp |= (p_init->sample_method | p_init->nack_state | (p_init->auto_retry_count << 17U));
    USART_CTL2(periph) = reg_temp;
    /* configure Rx overrun detection disabling */
    if(ENABLE == p_init->overrun_disable) {
        USART_CTL2(periph) |= USART_CTL2_OVRD;
    } else {
        USART_CTL2(periph) &= ~(USART_CTL2_OVRD);
    }

    /* configure DMA disabling on reception error */
    if(ENABLE == p_init->rx_error_dma_stop) {
        USART_CTL2(periph) |= USART_CTL2_DDRE;
    } else {
        USART_CTL2(periph) &= ~(USART_CTL2_DDRE);
    }

