PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_smartcard.c
    /* configure GP register */
    reg_temp = USART_GP(periph);
    reg_temp &= ~(USART_GP_PSC | USART_GP_GUAT);
    reg_temp |= ((p_init->guard_time << 8U) | (p_init->prescaler));
    USART_GP(periph) = reg_temp;

    /* configure RT register */
    reg_temp = USART_RT(periph);
    reg_temp &= ~(USART_RT_RT | USART_RT_BL);
    reg_temp |= ((p_init->block_length << 24U));
    if(ENABLE == p_init->timeout_enable) {
        reg_temp |= p_init->timeout_value;
    }
    USART_RT(periph) = reg_temp;

    /* configure RFCS register */
    if(ENABLE == p_init->early_nack) {
        USART_RFCS(periph) |= USART_RFCS_ELNACK;
    } else {
        USART_RFCS(periph) &= ~USART_RFCS_ELNACK;
    }
    if(ENABLE == p_init->rx_fifo_en) {
        USART_RFCS(periph) |= USART_RFCS_RFEN;
    } else {
        USART_RFCS(periph) &= ~USART_RFCS_RFEN;
    }

    /* configure baud rate */
    hals_smartcard_baudrate_set(periph, p_init->baudrate);

    /* clear LMEN, HDEN, IREN */
    hals_uart_halfduplex_disable(periph);
    hals_irda_mode_disable(periph);
    hals_uart_lin_mode_disable(periph);

    /* enable smartcard */
    hals_smartcard_mode_enable(periph);

    /* initialize Tx and Rx state */
    smartcard->tx_state = SMARTCARD_STATE_FREE;
    smartcard->rx_state = SMARTCARD_STATE_FREE;

    /* enable usart */
    hals_smartcard_enable(smartcard->periph);

    /* unlock smartcard */
    HAL_UNLOCK(smartcard);

    return HAL_ERR_NONE;
}

/*!
    \brief      smartcard interrupt handler content function,which is merely used in smartcard_handler
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_smartcard_irq(hal_smartcard_dev_struct *smartcard)
{
    /* if no error occurs */
    if(RESET == _smartcard_error_flag_get(smartcard)) {
        /* if SMARTCARD is in receiver mode */
        if(RESET != hals_smartcard_interrupt_flag_get(smartcard->periph, USART_INT_FLAG_RBNE)) {
            if(NULL != smartcard->smartcard_irq.receive_complete_handle) {
                smartcard->smartcard_irq.receive_complete_handle(smartcard);
            }
            return;
        }

        /* if some errors occur */
    } else {
        /* smartcard parity error interrupt occurred */
        if(RESET != hals_smartcard_interrupt_flag_get(smartcard->periph, USART_INT_FLAG_PERR)) {
            hals_smartcard_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_PERR);
            smartcard->error_state |= HAL_SMARTCARD_ERROR_PERR;
            smartcard->last_error = HAL_SMARTCARD_ERROR_PERR;
        }

        /* smartcard noise error interrupt occurred */
        if(RESET != hals_smartcard_interrupt_flag_get(smartcard->periph, USART_INT_FLAG_ERR_NERR)) {
            hals_smartcard_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_ERR_NERR);
            smartcard->error_state |= HAL_SMARTCARD_ERROR_NERR;
            smartcard->last_error = HAL_SMARTCARD_ERROR_NERR;
        }

        /* smartcard frame error interrupt occurred */
        if(RESET != hals_smartcard_interrupt_flag_get(smartcard->periph, USART_INT_FLAG_ERR_FERR)) {
            hals_smartcard_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_ERR_FERR);
            smartcard->error_state |= HAL_SMARTCARD_ERROR_FERR;
            smartcard->last_error = HAL_SMARTCARD_ERROR_FERR;
        }

        /* smartcard overrun interrupt occurred */
        if(RESET != hals_smartcard_interrupt_flag_get(smartcard->periph, USART_INT_FLAG_ERR_ORERR)) {
            hals_smartcard_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_ERR_ORERR);
            smartcard->error_state |= HAL_SMARTCARD_ERROR_ORERR;
            smartcard->last_error = HAL_SMARTCARD_ERROR_ORERR;
        }

        /* smartcard read data buffer not empty and overrun error overrun interrupt occurred */
        if(RESET != hals_smartcard_interrupt_flag_get(smartcard->periph, USART_INT_FLAG_RBNE_ORERR)) {
            hals_smartcard_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_RBNE_ORERR);
            smartcard->error_state |= HAL_SMARTCARD_ERROR_ORERR;
            smartcard->last_error = HAL_SMARTCARD_ERROR_ORERR;
        }

        /* smartcard receiver timeout interrupt occurred */
        if(RESET != hals_smartcard_interrupt_flag_get(smartcard->periph, USART_INT_FLAG_RT)) {
            hals_smartcard_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_RT);
            smartcard->error_state |= HAL_SMARTCARD_ERROR_RTF;
            smartcard->last_error = HAL_SMARTCARD_ERROR_RTF;
        }

        if(HAL_SMARTCARD_ERROR_NONE != smartcard->error_state) {
            /* call error callback  */
            if(NULL != smartcard->smartcard_irq.error_handle) {
                smartcard->smartcard_irq.error_handle(smartcard);
                smartcard->error_state = HAL_SMARTCARD_ERROR_NONE;
            }
            return;
        }
    }

    /* transmitter buffer empty interrupt handle */
    if(RESET != hals_smartcard_interrupt_flag_get(smartcard->periph, USART_INT_FLAG_TBE)) {
        if(smartcard->smartcard_irq.transmit_ready_handle != NULL) {
            smartcard->smartcard_irq.transmit_ready_handle(smartcard);
        }

        return;
    }

    /* transmission complete interrupt handle */
    if(RESET != hals_smartcard_interrupt_flag_get(smartcard->periph, USART_INT_FLAG_TC)) {
        hals_smartcard_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_TC);

        if(NULL != smartcard->smartcard_irq.transmit_complete_handle) {
            smartcard->smartcard_irq.transmit_complete_handle(smartcard);
        }

        return;
    }
}

/*!
    \brief      set user-defined interrupt callback function
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_irq: smartcard interrupt callback function pointer
    \param[out] none
    \retval     none
*/
void hal_smartcard_irq_handle_set(hal_smartcard_dev_struct *smartcard, hal_smartcard_irq_struct *p_irq)
{
    /* initialize smartcard error callback */
    if(NULL != p_irq->error_handle) {
        smartcard->smartcard_irq.error_handle = p_irq->error_handle;
        hals_smartcard_interrupt_enable(smartcard->periph, USART_INT_ERR);
        hals_smartcard_interrupt_enable(smartcard->periph, USART_INT_PERR);
    } else {
        smartcard->smartcard_irq.error_handle = NULL;
        hals_smartcard_interrupt_disable(smartcard->periph, USART_INT_ERR);
        hals_smartcard_interrupt_disable(smartcard->periph, USART_INT_PERR);
    }

    /* initialize smartcard receive completed callback */
    if(NULL != p_irq->receive_complete_handle) {
        smartcard->smartcard_irq.receive_complete_handle = p_irq->receive_complete_handle;
        hals_smartcard_interrupt_enable(smartcard->periph, USART_INT_RBNE);
    } else {
        smartcard->smartcard_irq.receive_complete_handle = NULL;
        hals_smartcard_interrupt_disable(smartcard->periph, USART_INT_RBNE);
    }

    /* initialize smartcard transmit completed callback */
    if(NULL != p_irq->transmit_complete_handle) {
        smartcard->smartcard_irq.transmit_complete_handle = p_irq->transmit_complete_handle;
        hals_smartcard_interrupt_enable(smartcard->periph, USART_INT_TC);
    } else {
        smartcard->smartcard_irq.transmit_complete_handle = NULL;
        hals_smartcard_interrupt_disable(smartcard->periph, USART_INT_TC);
    }

    /* initialize smartcard transmit ready callback */
    if(NULL != p_irq->transmit_ready_handle) {
        smartcard->smartcard_irq.transmit_ready_handle = p_irq->transmit_ready_handle;
        hals_smartcard_interrupt_enable(smartcard->periph, USART_INT_TBE);
    } else {
        smartcard->smartcard_irq.transmit_ready_handle = NULL;
        hals_smartcard_interrupt_disable(smartcard->periph, USART_INT_TBE);
    }
}

/*!
    \brief      reset all user-defined interrupt callback function
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_smartcard_irq_handle_all_reset(hal_smartcard_dev_struct *smartcard)
{
    /* configure interrupt callback function to NULL */
    smartcard->smartcard_irq.error_handle = NULL;
    smartcard->smartcard_irq.receive_complete_handle = NULL;
    smartcard->smartcard_irq.transmit_complete_handle = NULL;
    smartcard->smartcard_irq.transmit_ready_handle = NULL;
}

/*!
    \brief      transmit amounts of data by poll method
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be transmitted
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY, HAL_ERR_TIMEOUT details refer to gd32f3x0_hal.h
*/
int32_t hal_smartcard_transmit_poll(hal_smartcard_dev_struct *smartcard, uint8_t *p_buffer, uint32_t length, uint32_t timeout_ms)
{
    uint32_t tick_start;

#if (1U == HAL_PARAMETER_CHECK)
    /* check smartcard pointer, p_buffer address and length */
    if((NULL == smartcard) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [usart] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1U == HAL_PARAMETER_CHECK */

    /* check whether the Tx state is in ready */
    if(SMARTCARD_STATE_BUSY == smartcard->tx_state) {
        HAL_DEBUGE("usart tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* lock smartcard */
    HAL_LOCK(smartcard);

    /* disable receive and enable transmit */
    hals_smartcard_receive_config(smartcard->periph, USART_RECEIVE_DISABLE);
    hals_smartcard_command_enable(smartcard->periph, USART_CMD_RXFCMD);
    hals_smartcard_transmit_config(smartcard->periph, USART_TRANSMIT_ENABLE);

    /* initialize transmit parameter */
    smartcard->error_state = HAL_SMARTCARD_ERROR_NONE;
    smartcard->tx_state = SMARTCARD_STATE_BUSY;
    smartcard->txbuffer.buffer  = (uint8_t *)p_buffer;
    smartcard->txbuffer.length  = length;
    smartcard->txbuffer.pos     = 0U;

    /* configure timeout */
    tick_start = hal_sys_basetick_count_get();

    while(smartcard->txbuffer.pos < smartcard->txbuffer.length) {
        /* wait for transmit buffer empty */
        while(RESET == hals_smartcard_flag_get(smartcard->periph, USART_FLAG_TBE)) {
            if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                    HAL_DEBUGW("smartcard transmit timeout");
                    smartcard->tx_state = SMARTCARD_STATE_FREE;
                    /* unlock smartcard */
                    HAL_UNLOCK(smartcard);

                    return HAL_ERR_TIMEOUT;
                }
            }
        }

        /* write the data to be transmitted */
        hals_smartcard_data_transmit(smartcard->periph, (*smartcard->txbuffer.buffer & (uint8_t)0xFFU));
        smartcard->txbuffer.buffer++;
        /* change the transmit pointer */
        smartcard->txbuffer.pos++;
    }

    /* wait for transmit complete */
    while(RESET == hals_smartcard_flag_get(smartcard->periph, USART_FLAG_TC)) {
        if(HAL_TIMEOUT_FOREVER != timeout_ms) {
            if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                HAL_DEBUGW("smartcard transmit timeout");
                smartcard->tx_state = SMARTCARD_STATE_FREE;
                /* unlock smartcard */
                HAL_UNLOCK(smartcard);
                return HAL_ERR_TIMEOUT;
            }
        }
    }

