PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_smartcard.c
    /* initialize receive parameter */
    smartcard->rxbuffer.buffer  = (uint8_t *)p_buffer;
    smartcard->rxbuffer.length  = length;
    smartcard->rxbuffer.pos     = 0U;
    smartcard->rx_callback      = (void *)p_user_func;
    smartcard->smartcard_irq.receive_complete_handle = _smartcard_receive_interrupt;

    /* enable interrupt */
    hals_smartcard_interrupt_enable(smartcard->periph, USART_INT_PERR);
    hals_smartcard_interrupt_enable(smartcard->periph, USART_INT_ERR);
    hals_smartcard_interrupt_enable(smartcard->periph, USART_INT_RBNE);

    /* unlock smartcard */
    HAL_UNLOCK(smartcard);

    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data by dma method
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be transmitted
    \param[in]  p_user_func: user callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_BUSY, details refer to gd32f3x0_hal.h
*/
int32_t hal_smartcard_transmit_dma(hal_smartcard_dev_struct *smartcard, uint8_t *p_buffer, uint16_t length, hal_smartcard_user_callback_struct *p_user_func)
{
    hal_dma_irq_struct dma_irq;

#if (1U == HAL_PARAMETER_CHECK)
    /* check smartcard pointer, p_buffer address and length */
    if((NULL == smartcard) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [usart] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1U == HAL_PARAMETER_CHECK */

    /* check whether the Tx state is in ready */
    if(SMARTCARD_STATE_BUSY == smartcard->tx_state) {
        HAL_DEBUGE("usart tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* check whether the pointer of DMA Tx is NULL */
    if(NULL == smartcard->p_dma_tx) {
        HAL_DEBUGE("parameter [smartcard->p_dma_tx] value is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* lock smartcard */
    HAL_LOCK(smartcard);

    smartcard->tx_state = SMARTCARD_STATE_BUSY;
    smartcard->error_state = HAL_SMARTCARD_ERROR_NONE;

    /* disable receive and enable transmit */
    hals_smartcard_receive_config(smartcard->periph, USART_RECEIVE_DISABLE);
    hals_smartcard_command_enable(smartcard->periph, USART_CMD_RXFCMD);
    hals_smartcard_transmit_config(smartcard->periph, USART_TRANSMIT_ENABLE);

    /* initialize transmit parameter */
    smartcard->txbuffer.buffer  = (uint8_t *)p_buffer;
    smartcard->txbuffer.length  = length;
    smartcard->txbuffer.pos     = 0U;

    if(NULL != p_user_func) {
        smartcard->tx_callback = (void *)p_user_func->complete_func;
        smartcard->smartcard_irq.error_handle = (hal_irq_handle_cb)p_user_func->error_func;
    } else {
        smartcard->tx_callback = NULL;
        smartcard->smartcard_irq.error_handle = NULL;
    }
    smartcard->smartcard_irq.transmit_complete_handle = _smartcard_transmit_complete_interrupt;

    /* configure DMA interrupt callback function */
    dma_irq.full_finish_handle = _smartcard_transmit_dma;
    dma_irq.error_handle = _smartcard_dma_error;
    if(NULL != smartcard->p_dma_tx->dma_irq.half_finish_handle) {
        dma_irq.half_finish_handle = smartcard->p_dma_tx->dma_irq.half_finish_handle;
    } else {
        dma_irq.half_finish_handle = NULL;
    }

    /* start DMA interrupt mode transfer */
    if(HAL_ERR_NONE != hal_dma_start_interrupt(smartcard->p_dma_tx,
            (uint32_t)smartcard->txbuffer.buffer, (uint32_t)&USART_TDATA(smartcard->periph),
            smartcard->txbuffer.length, &dma_irq)) {
        smartcard->tx_state = SMARTCARD_STATE_FREE;
        smartcard->error_state = HAL_SMARTCARD_ERROR_DMATX;
        /* unlock uart */
        HAL_UNLOCK(smartcard);
    }

    /* clear SMARTCARD TC interrupt flag */
    hals_smartcard_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_TC);

    /* enable ERR interrupt(frame error) */
    hals_smartcard_interrupt_enable(smartcard->periph, USART_INT_ERR);

    /* DMA enable for smartcard transmission */
    hals_smartcard_dma_transmit_config(smartcard->periph, USART_TRANSMIT_DMA_ENABLE);

    /* unlock smartcard */
    HAL_UNLOCK(smartcard);

    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data by dma method
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be sent received
    \param[in]  p_user_func: user callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_BUSY, details refer to gd32f3x0_hal.h
*/
int32_t hal_smartcard_receive_dma(hal_smartcard_dev_struct *smartcard, uint8_t *p_buffer, uint16_t length, hal_smartcard_user_callback_struct *p_user_func)
{
    hal_dma_irq_struct dma_irq;

#if (1U == HAL_PARAMETER_CHECK)
    /* check smartcard pointer, p_buffer address and length */
    if((NULL == smartcard) || (NULL == p_buffer) || (0 == length)) {
        HAL_DEBUGE("parameter [usart] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1U == HAL_PARAMETER_CHECK */

    /* check whether the Rx state is in ready */
    if(SMARTCARD_STATE_BUSY == smartcard->rx_state) {
        HAL_DEBUGE("usart rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* check whether the pointer of DMA Rx is NULL */
    if(NULL == smartcard->p_dma_rx) {
        HAL_DEBUGE("parameter [smartcard->p_dma_rx] value is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* lock smartcard */
    HAL_LOCK(smartcard);

    smartcard->rx_state = SMARTCARD_STATE_BUSY;
    smartcard->error_state = HAL_SMARTCARD_ERROR_NONE;

