PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_smartcard.c
    /* initialize receive parameter */
    smartcard->rxbuffer.buffer  = (uint8_t *)p_buffer;
    smartcard->rxbuffer.length  = length;
    smartcard->rxbuffer.pos     = 0U;

    if(NULL != p_user_func) {
        smartcard->rx_callback = (void *)p_user_func->complete_func;
        smartcard->smartcard_irq.error_handle = (hal_irq_handle_cb)p_user_func->error_func;
    } else {
        smartcard->rx_callback = NULL;
        smartcard->smartcard_irq.error_handle = NULL;
    }

    /* configure DMA interrupt interrupt callback function */
    dma_irq.full_finish_handle = _smartcard_receive_dma;
    dma_irq.error_handle = _smartcard_dma_error;
    if(NULL != smartcard->p_dma_rx->dma_irq.half_finish_handle) {
        dma_irq.half_finish_handle = smartcard->p_dma_rx->dma_irq.half_finish_handle;
    } else {
        dma_irq.half_finish_handle = NULL;
    }

    /* start DMA interrupt mode transfer */
    if(HAL_ERR_NONE != hal_dma_start_interrupt(smartcard->p_dma_rx,
            (uint32_t)&USART_RDATA(smartcard->periph), (uint32_t)smartcard->rxbuffer.buffer,
            smartcard->rxbuffer.length, &dma_irq)) {
        smartcard->rx_state = SMARTCARD_STATE_FREE;
        smartcard->error_state = HAL_SMARTCARD_ERROR_DMARX;
        /* unlock uart */
        HAL_UNLOCK(smartcard);
    }

    /* enable the usart parity error interrupt */
    hals_smartcard_interrupt_enable(smartcard->periph, USART_INT_PERR);

    /* enable the usart error interrupt: (frame error, noise error, overrun error) */
    hals_smartcard_interrupt_enable(smartcard->periph, USART_INT_ERR);

    /* DMA enable for smartcard reception */
    hals_smartcard_dma_receive_config(smartcard->periph, USART_RECEIVE_DMA_ENABLE);

    /* unlock smartcard */
    HAL_UNLOCK(smartcard);

    return HAL_ERR_NONE;
}

/*!
    \brief      stop smartcard transmit transfer
                the function is blocking
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_smartcard_transmit_stop(hal_smartcard_dev_struct *smartcard)
{
#if (1U == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == smartcard) {
        HAL_DEBUGE("parameter [smartcard] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1U == HAL_PARAMETER_CHECK */

    /* lock smartcard */
    HAL_LOCK(smartcard);

    /* disable the TBE and TC interrupt */
    hals_smartcard_interrupt_disable(smartcard->periph, USART_INT_TBE);
    hals_smartcard_interrupt_disable(smartcard->periph, USART_INT_TC);

    /* check receive state, if free then disable ERR interrupt */
    if(SMARTCARD_STATE_FREE == smartcard->rx_state) {
        hals_smartcard_interrupt_disable(smartcard->periph, USART_INT_ERR);
    }

    /* disable DMA transimt and stop DMA */
    hals_smartcard_dma_transmit_config(smartcard->periph, USART_TRANSMIT_DMA_DISABLE);
    hal_dma_stop(smartcard->p_dma_tx);

    /* reset the position and state */
    smartcard->txbuffer.pos = 0U;
    smartcard->tx_state = SMARTCARD_STATE_FREE;

    /* clear interrupt error flags */
    hals_smartcard_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_ERR_FERR);

    /* unlock smartcard */
    HAL_UNLOCK(smartcard);

    return HAL_ERR_NONE;
}

/*!
    \brief      stop smartcard receive transfer
                the function is blocking
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_smartcard_receive_stop(hal_smartcard_dev_struct *smartcard)
{
#if (1U == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == smartcard) {
        HAL_DEBUGE("parameter [smartcard] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1U == HAL_PARAMETER_CHECK */

    /* lock smartcard */
    HAL_LOCK(smartcard);

    /* disable the RBNE, PERR, ERR, EB and RT interrupt */
    hals_smartcard_interrupt_disable(smartcard->periph, USART_INT_RBNE);
    hals_smartcard_interrupt_disable(smartcard->periph, USART_INT_PERR);
    hals_smartcard_interrupt_disable(smartcard->periph, USART_INT_EB);
    hals_smartcard_interrupt_disable(smartcard->periph, USART_INT_RT);

    /* check transmit state, if free then disable ERR interrupt */
    if(SMARTCARD_STATE_FREE == smartcard->tx_state) {
        hals_smartcard_interrupt_disable(smartcard->periph, USART_INT_ERR);
    }

    /* disable DMA receive and stop DMA */
    hals_smartcard_dma_receive_config(smartcard->periph, USART_RECEIVE_DMA_DISABLE);
    hal_dma_stop(smartcard->p_dma_rx);

    /* reset the position and state */
    smartcard->rxbuffer.pos = 0U;
    smartcard->rx_state = SMARTCARD_STATE_FREE;

    /* clear interrupt error flags */
    hals_smartcard_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_PERR);
    hals_smartcard_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_ERR_FERR);
    hals_smartcard_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_ERR_NERR);
    hals_smartcard_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_ERR_ORERR);
    hals_smartcard_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_EB);
    hals_smartcard_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_RT);

    /* unlock smartcard */
    HAL_UNLOCK(smartcard);

    return HAL_ERR_NONE;
}

/*!
    \brief      reset SMARTCARD
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_smartcard_deinit(uint32_t smartcard_periph)
{
    switch(smartcard_periph) {
    case USART0:
        /* reset USART0 */
        hal_rcu_periph_reset_enable(RCU_USART0RST);
        hal_rcu_periph_reset_disable(RCU_USART0RST);
        break;
    case USART1:
        /* reset USART1 */
        hal_rcu_periph_reset_enable(RCU_USART1RST);
        hal_rcu_periph_reset_disable(RCU_USART1RST);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure SMARTCARD baud rate value
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  baudval: baud rate value
    \param[out] none
    \retval     none
*/
void hals_smartcard_baudrate_set(uint32_t smartcard_periph, uint32_t baudval)
{
    uint32_t uclk = 0U, intdiv = 0U, fradiv = 0U, udiv = 0U;
    switch(smartcard_periph) {
    /* get clock frequency */
    case USART0:
        /* get USART0 clock */
        uclk = hals_rcu_clock_freq_get(CK_USART);
        break;
    case USART1:
        /* get USART1 clock */
        uclk = hals_rcu_clock_freq_get(CK_APB1);
        break;
    default:
        break;
    }
    if(USART_CTL0(smartcard_periph) & USART_CTL0_OVSMOD) {
        /* oversampling by 8, configure the value of USART_BAUD */
        udiv = ((2U * uclk) + (baudval / 2U)) / baudval;
        intdiv = udiv & 0x0000fff0U;
        fradiv = (udiv >> 1U) & 0x00000007U;
        USART_BAUD(smartcard_periph) = ((USART_BAUD_FRADIV | USART_BAUD_INTDIV) & (intdiv | fradiv));
    } else {
        /* oversampling by 16, configure the value of USART_BAUD */
        udiv = (uclk + (baudval / 2U)) / baudval;
        intdiv = udiv & 0x0000fff0U;
        fradiv = udiv & 0x0000000fU;
        USART_BAUD(smartcard_periph) = ((USART_BAUD_FRADIV | USART_BAUD_INTDIV) & (intdiv | fradiv));
    }
}

/*!
    \brief      configure SMARTCARD parity
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  paritycfg: SMARTCARD parity configure
                only one parameter can be selected which is shown as below:
      \arg        USART_PM_NONE: no parity
      \arg        USART_PM_ODD: odd parity
      \arg        USART_PM_EVEN: even parity
    \param[out] none
    \retval     none
*/
void hals_smartcard_parity_config(uint32_t smartcard_periph, uint32_t paritycfg)
{
    /* disable SMARTCARD */
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);
    /* clear USART_CTL0 PM,PCEN bits */
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_PM | USART_CTL0_PCEN);
    /* configure SMARTCARD parity mode */
    USART_CTL0(smartcard_periph) |= paritycfg;
}

/*!
    \brief      configure SMARTCARD word length
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  wlen: SMARTCARD word length configure
                only one parameter can be selected which is shown as below:
      \arg        USART_WL_8BIT: 8 bits
      \arg        USART_WL_9BIT: 9 bits
    \param[out] none
    \retval     none
*/
void hals_smartcard_word_length_set(uint32_t smartcard_periph, uint32_t wlen)
{
    /* disable SMARTCARD */
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);
    /* clear USART_CTL0 WL bit */
    USART_CTL0(smartcard_periph) &= ~USART_CTL0_WL;
    /* configure SMARTCARD word length */
    USART_CTL0(smartcard_periph) |= wlen;
}

/*!
    \brief      configure SMARTCARD stop bit length
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  stblen: SMARTCARD stop bit configure
                only one parameter can be selected which is shown as below:
      \arg        USART_STB_1BIT: 1 bit
      \arg        USART_STB_0_5BIT: 0.5bit
      \arg        USART_STB_2BIT: 2 bits
      \arg        USART_STB_1_5BIT: 1.5bit
    \param[out] none
    \retval     none
*/
void hals_smartcard_stop_bit_set(uint32_t smartcard_periph, uint32_t stblen)
{
    /* disable SMARTCARD */
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);
    /* clear USART_CTL1 STB bits */
    USART_CTL1(smartcard_periph) &= ~USART_CTL1_STB;
    USART_CTL1(smartcard_periph) |= stblen;
}

/*!
    \brief      enable SMARTCARD
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_smartcard_enable(uint32_t smartcard_periph)
{
    USART_CTL0(smartcard_periph) |= USART_CTL0_UEN;
}

/*!
    \brief      disable SMARTCARD
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_smartcard_disable(uint32_t smartcard_periph)
{
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);
}

/*!
    \brief      configure SMARTCARD transmitter
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  txconfig: enable or disable SMARTCARD transmitter
                only one parameter can be selected which is shown as below:
      \arg        USART_TRANSMIT_ENABLE: enable SMARTCARD transmission
      \arg        USART_TRANSMIT_DISABLE: enable SMARTCARD transmission
    \param[out] none
    \retval     none
*/
void hals_smartcard_transmit_config(uint32_t smartcard_periph, uint32_t txconfig)
{
    USART_CTL0(smartcard_periph) &= ~USART_CTL0_TEN;
    /* configure transfer mode */
    USART_CTL0(smartcard_periph) |= txconfig;
}

/*!
    \brief      configure SMARTCARD receiver
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  rxconfig: enable or disable SMARTCARD receiver
                only one parameter can be selected which is shown as below:
      \arg        USART_RECEIVE_ENABLE: enable SMARTCARD reception
      \arg        USART_RECEIVE_DISABLE: disable SMARTCARD reception
    \param[out] none
    \retval     none
*/
void hals_smartcard_receive_config(uint32_t smartcard_periph, uint32_t rxconfig)
{
    USART_CTL0(smartcard_periph) &= ~USART_CTL0_REN;
    /* configure receiver mode */
    USART_CTL0(smartcard_periph) |= rxconfig;
}

/*!
    \brief      data is transmitted/received with the LSB/MSB first
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  msbf: LSB/MSB
                only one parameter can be selected which is shown as below:
      \arg        USART_MSBF_LSB: LSB first
      \arg        USART_MSBF_MSB: MSB first
    \param[out] none
    \retval     none
*/
void hals_smartcard_data_first_config(uint32_t smartcard_periph, uint32_t msbf)
{
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);
    /* configure LSB or MSB first */
    USART_CTL1(smartcard_periph) &= ~(USART_CTL1_MSBF);
    USART_CTL1(smartcard_periph) |= msbf;
}

/*!
    \brief      configure SMARTCARD inversion
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  invertpara: refer to usart_invert_enum
                only one parameter can be selected which is shown as below:
      \arg        USART_DINV_ENABLE: data bit level inversion
      \arg        USART_DINV_DISABLE: data bit level not inversion
      \arg        USART_TXPIN_ENABLE: TX pin level inversion
      \arg        USART_TXPIN_DISABLE: TX pin level not inversion
      \arg        USART_RXPIN_ENABLE: RX pin level inversion
      \arg        USART_RXPIN_DISABLE: RX pin level not inversion
      \arg        USART_SWAP_ENABLE: swap TX/RX pins
      \arg        USART_SWAP_DISABLE: not swap TX/RX pins
    \param[out] none
    \retval     none
*/
void hals_smartcard_invert_config(uint32_t smartcard_periph, usart_invert_enum invertpara)
{
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);
    /* inverted or not the specified signal */
    switch(invertpara) {
    case USART_DINV_ENABLE:
        USART_CTL1(smartcard_periph) |= USART_CTL1_DINV;
        break;
    case USART_DINV_DISABLE:
        USART_CTL1(smartcard_periph) &= ~(USART_CTL1_DINV);
        break;
    case USART_TXPIN_ENABLE:
        USART_CTL1(smartcard_periph) |= USART_CTL1_TINV;
        break;
    case USART_TXPIN_DISABLE:
        USART_CTL1(smartcard_periph) &= ~(USART_CTL1_TINV);
        break;
    case USART_RXPIN_ENABLE:
        USART_CTL1(smartcard_periph) |= USART_CTL1_RINV;
        break;
    case USART_RXPIN_DISABLE:
        USART_CTL1(smartcard_periph) &= ~(USART_CTL1_RINV);
        break;
    case USART_SWAP_ENABLE:
        USART_CTL1(smartcard_periph) |= USART_CTL1_STRP;
        break;
    case USART_SWAP_DISABLE:
        USART_CTL1(smartcard_periph) &= ~(USART_CTL1_STRP);
        break;
    default:
        break;
    }
}

/*!
    \brief      enable the SMARTCARD overrun function
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_smartcard_overrun_enable(uint32_t smartcard_periph)
{
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);
    /* enable overrun function */
    USART_CTL2(smartcard_periph) &= ~(USART_CTL2_OVRD);
}

/*!
    \brief      disable the SMARTCARD overrun function
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_smartcard_overrun_disable(uint32_t smartcard_periph)
{
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);
    /* disable overrun function */
    USART_CTL2(smartcard_periph) |= USART_CTL2_OVRD;
}

/*!
    \brief      configure the SMARTCARD oversample mode
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  oversamp: oversample value
                only one parameter can be selected which is shown as below:
      \arg        USART_OVSMOD_8: oversampling by 8
      \arg        USART_OVSMOD_16: oversampling by 16
    \param[out] none
    \retval     none
*/
void hals_smartcard_oversample_config(uint32_t smartcard_periph, uint32_t oversamp)
{
    /* disable SMARTCARD */
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);
    /* clear OVSMOD bit */
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_OVSMOD);
    USART_CTL0(smartcard_periph) |= oversamp;
}

/*!
    \brief      configure the sample bit method
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  osb: sample bit
                only one parameter can be selected which is shown as below:
      \arg        USART_OSB_1BIT: 1 bit
      \arg        USART_OSB_3BIT: 3 bits
    \param[out] none
    \retval     none
*/
void hals_smartcard_sample_bit_config(uint32_t smartcard_periph, uint32_t osb)
{
    /* disable SMARTCARD */
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);

    USART_CTL2(smartcard_periph) &= ~(USART_CTL2_OSB);
    USART_CTL2(smartcard_periph) |= osb;
}

/*!
    \brief      enable receiver timeout
    \param[in]  smartcard_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_smartcard_receiver_timeout_enable(uint32_t smartcard_periph)
{
    USART_CTL1(smartcard_periph) |= USART_CTL1_RTEN;
}

/*!
    \brief      disable receiver timeout
    \param[in]  smartcard_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_smartcard_receiver_timeout_disable(uint32_t smartcard_periph)
{
    USART_CTL1(smartcard_periph) &= ~(USART_CTL1_RTEN);
}

/*!
    \brief      configure receiver timeout threshold
    \param[in]  smartcard_periph: USARTx(x=0)
    \param[in]  rtimeout: 0x00000000-0x00FFFFFF, receiver timeout value in terms of number of baud clocks
    \param[out] none
    \retval     none
*/
void hals_smartcard_receiver_timeout_threshold_config(uint32_t smartcard_periph, uint32_t rtimeout)
{
    USART_RT(smartcard_periph) &= ~(USART_RT_RT);
    USART_RT(smartcard_periph) |= rtimeout;
}

/*!
    \brief      SMARTCARD transmit data function
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  data: data of transmission
    \param[out] none
    \retval     none
*/
void hals_smartcard_data_transmit(uint32_t smartcard_periph, uint16_t data)
{
    USART_TDATA(smartcard_periph) = (USART_TDATA_TDATA & (uint32_t)data);
}

/*!
    \brief      SMARTCARD receive data function
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[out] none
    \retval     data of received
*/
uint16_t hals_smartcard_data_receive(uint32_t smartcard_periph)
{
    return (uint16_t)(GET_BITS(USART_RDATA(smartcard_periph), 0U, 8U));
}

/*!
    \brief      enable SMARTCARD command
    \param[in]  smartcard_periph: USARTx(x=0,1,2)
    \param[in]  cmdtype: command type
                only one parameter can be selected which is shown as below:
      \arg        USART_CMD_SBKCMD: send break command
      \arg        USART_CMD_MMCMD: mute mode command
      \arg        USART_CMD_RXFCMD: receive data flush command
      \arg        USART_CMD_TXFCMD: transmit data flush request
    \param[out] none
    \retval     none
*/
void hals_smartcard_command_enable(uint32_t smartcard_periph, uint32_t cmdtype)
{
    USART_CMD(smartcard_periph) |= (cmdtype);
}

/*!
    \brief      enable SMARTCARD clock
    \param[in]  smartcard_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_smartcard_clock_enable(uint32_t smartcard_periph)
{
    /* disable SMARTCARD */
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);

    USART_CTL1(smartcard_periph) |= USART_CTL1_CKEN;
}

/*!
    \brief      disable SMARTCARD clock
    \param[in]  smartcard_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_smartcard_clock_disable(uint32_t smartcard_periph)
{
    /* disable SMARTCARD */
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);

    USART_CTL1(smartcard_periph) &= ~(USART_CTL1_CKEN);
}

/*!
    \brief      configure SMARTCARD synchronous mode parameters
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  clen: last bit clock pulse
                only one parameter can be selected which is shown as below:
      \arg        USART_CLEN_NONE: clock pulse of the last data bit (MSB) is not output to the CK pin
      \arg        USART_CLEN_EN: clock pulse of the last data bit (MSB) is output to the CK pin
    \param[in]  cph: clock phase
                only one parameter can be selected which is shown as below:
      \arg        USART_CPH_1CK: first clock transition is the first data capture edge
      \arg        USART_CPH_2CK: second clock transition is the first data capture edge
    \param[in]  cpl: clock polarity
                only one parameter can be selected which is shown as below:
      \arg        USART_CPL_LOW: steady low value on CK pin
      \arg        USART_CPL_HIGH: steady high value on CK pin
    \param[out] none
    \retval     none
*/
void hals_smartcard_synchronous_clock_config(uint32_t smartcard_periph, uint32_t clen, uint32_t cph,
        uint32_t cpl)
{
    /* disable SMARTCARD */
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);
    /* reset USART_CTL1 CLEN,CPH,CPL bits */
    USART_CTL1(smartcard_periph) &= ~(USART_CTL1_CLEN | USART_CTL1_CPH | USART_CTL1_CPL);

    USART_CTL1(smartcard_periph) |= (USART_CTL1_CLEN & clen);
    USART_CTL1(smartcard_periph) |= (USART_CTL1_CPH & cph);
    USART_CTL1(smartcard_periph) |= (USART_CTL1_CPL & cpl);
}

/*!
    \brief      configure guard time value in smartcard mode
    \param[in]  smartcard_periph: USARTx(x=0)
    \param[in]  guat: 0x00-0xFF
    \param[out] none
    \retval     none
*/
void hals_smartcard_guard_time_config(uint32_t smartcard_periph, uint32_t guat)
{
    /* disable SMARTCARD */
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);

