PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_smartcard.c
    USART_GP(smartcard_periph) &= ~(USART_GP_GUAT);
    USART_GP(smartcard_periph) |= (USART_GP_GUAT & ((guat) << GP_GUAT_OFFSET));
}

/*!
    \brief      enable smartcard mode
    \param[in]  smartcard_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_smartcard_mode_enable(uint32_t smartcard_periph)
{
    /* disable SMARTCARD */
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);

    USART_CTL2(smartcard_periph) |= USART_CTL2_SCEN;
}

/*!
    \brief      disable smartcard mode
    \param[in]  smartcard_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_smartcard_mode_disable(uint32_t smartcard_periph)
{
    /* disable SMARTCARD */
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);

    USART_CTL2(smartcard_periph) &= ~(USART_CTL2_SCEN);
}

/*!
    \brief      enable NACK in smartcard mode
    \param[in]  smartcard_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_smartcard_mode_nack_enable(uint32_t smartcard_periph)
{
    /* disable SMARTCARD */
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);

    USART_CTL2(smartcard_periph) |= USART_CTL2_NKEN;
}

/*!
    \brief      disable NACK in smartcard mode
    \param[in]  smartcard_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_smartcard_mode_nack_disable(uint32_t smartcard_periph)
{
    /* disable SMARTCARD */
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);

    USART_CTL2(smartcard_periph) &= ~(USART_CTL2_NKEN);
}

/*!
    \brief      enable early NACK in smartcard mode
    \param[in]  smartcard_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_smartcard_mode_early_nack_enable(uint32_t smartcard_periph)
{
    USART_RFCS(smartcard_periph) |= USART_RFCS_ELNACK;
}

/*!
    \brief      disable early NACK in smartcard mode
    \param[in]  smartcard_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_smartcard_mode_early_nack_disable(uint32_t smartcard_periph)
{
    USART_RFCS(smartcard_periph) &= ~USART_RFCS_ELNACK;
}

/*!
    \brief      configure smartcard auto-retry number
    \param[in]  smartcard_periph: USARTx(x=0)
    \param[in]  scrtnum: 0x00000000-0x00000007, smartcard auto-retry number
    \param[out] none
    \retval     none
*/
void hals_smartcard_autoretry_config(uint32_t smartcard_periph, uint32_t scrtnum)
{
    /* disable SMARTCARD */
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);
    USART_CTL2(smartcard_periph) &= ~(USART_CTL2_SCRTNUM);
    USART_CTL2(smartcard_periph) |= (USART_CTL2_SCRTNUM & (scrtnum << CTL2_SCRTNUM_OFFSET));
}

/*!
    \brief      configure block length
    \param[in]  smartcard_periph: USARTx(x=0)
    \param[in]  bl: 0x00000000-0x000000FF
    \param[out] none
    \retval     none
*/
void hals_smartcard_block_length_config(uint32_t smartcard_periph, uint32_t bl)
{
    USART_RT(smartcard_periph) &= ~(USART_RT_BL);
    USART_RT(smartcard_periph) |= (USART_RT_BL & ((bl) << RT_BL_OFFSET));
}

/*!
    \brief      configure SMARTCARD DMA reception
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  dmacmd: SMARTCARD DMA mode
                only one parameter can be selected which is shown as below:
      \arg        USART_RECEIVE_DMA_ENABLE: enable SMARTCARD DMA for reception
      \arg        USART_RECEIVE_DMA_DISABLE: disable SMARTCARD DMA for reception
    \param[out] none
    \retval     none
*/
void hals_smartcard_dma_receive_config(uint32_t smartcard_periph, uint8_t dmacmd)
{
    USART_CTL2(smartcard_periph) &= ~USART_CTL2_DENR;
    USART_CTL2(smartcard_periph) |= (USART_CTL2_DENR & dmacmd);
}

/*!
    \brief      configure SMARTCARD DMA transmission
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  dmacmd: SMARTCARD DMA mode
                only one parameter can be selected which is shown as below:
      \arg        USART_TRANSMIT_DMA_ENABLE: enable SMARTCARD DMA for transmission
      \arg        USART_TRANSMIT_DMA_DISABLE: disable SMARTCARD DMA for transmission
    \param[out] none
    \retval     none
*/
void hals_smartcard_dma_transmit_config(uint32_t smartcard_periph, uint8_t dmacmd)
{
    USART_CTL2(smartcard_periph) &= ~USART_CTL2_DENT;
    USART_CTL2(smartcard_periph) |= (USART_CTL2_DENT & dmacmd);
}

/*!
    \brief      enable DMA on reception error
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_smartcard_reception_error_dma_enable(uint32_t smartcard_periph)
{
    /* disable SMARTCARD */
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);
    USART_CTL2(smartcard_periph) &= ~(USART_CTL2_DDRE);
}

/*!
    \brief      disable DMA on reception error
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_smartcard_reception_error_dma_disable(uint32_t smartcard_periph)
{
    /* disable SMARTCARD */
    USART_CTL0(smartcard_periph) &= ~(USART_CTL0_UEN);
    USART_CTL2(smartcard_periph) |= USART_CTL2_DDRE;
}

/*!
    \brief      enable receive FIFO
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_smartcard_receive_fifo_enable(uint32_t smartcard_periph)
{
    USART_RFCS(smartcard_periph) |= USART_RFCS_RFEN;
}

/*!
    \brief      disable receive FIFO
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_smartcard_receive_fifo_disable(uint32_t smartcard_periph)
{
    USART_RFCS(smartcard_periph) &= ~(USART_RFCS_RFEN);
}

/*!
    \brief      read receive FIFO counter number
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[out] none
    \retval     receive FIFO counter number
*/
uint8_t hals_smartcard_receive_fifo_counter_number(uint32_t smartcard_periph)
{
    return (uint8_t)(GET_BITS(USART_RFCS(smartcard_periph), 12U, 14U));
}

/*!
    \brief      get SMARTCARD status
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        USART_FLAG_PERR: parity error flag
      \arg        USART_FLAG_FERR: frame error flag
      \arg        USART_FLAG_NERR: noise error flag
      \arg        USART_FLAG_ORERR: overrun error flag
      \arg        USART_FLAG_IDLE: idle line detected flag
      \arg        USART_FLAG_RBNE: read data buffer not empty
      \arg        USART_FLAG_TC: transmission complete flag
      \arg        USART_FLAG_TBE: transmit data register empty
      \arg        USART_FLAG_LBD: LIN break detected flag
      \arg        USART_FLAG_CTSF: CTS change flag
      \arg        USART_FLAG_CTS: CTS level
      \arg        USART_FLAG_RT: receiver timeout flag
      \arg        USART_FLAG_EB: end of block flag
      \arg        USART_FLAG_BSY: busy flag
      \arg        USART_FLAG_AM: address match flag
      \arg        USART_FLAG_SB: send break flag
      \arg        USART_FLAG_RWU: receiver wakeup from mute mode.
      \arg        USART_FLAG_WU: wakeup from deep-sleep mode flag
      \arg        USART_FLAG_TEA: transmit enable acknowledge flag
      \arg        USART_FLAG_REA: receive enable acknowledge flag
      \arg        USART_FLAG_EPERR: early parity error flag
      \arg        USART_FLAG_RFE: receive FIFO empty flag
      \arg        USART_FLAG_RFF: receive FIFO full flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus hals_smartcard_flag_get(uint32_t smartcard_periph, usart_flag_enum flag)
{
    if(RESET != (USART_REG_VAL(smartcard_periph, flag) & BIT(USART_BIT_POS(flag)))) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear SMARTCARD status
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        USART_FLAG_PERR: parity error flag
      \arg        USART_FLAG_FERR: frame error flag
      \arg        USART_FLAG_NERR: noise error flag
      \arg        USART_FLAG_ORERR: overrun error flag
      \arg        USART_FLAG_IDLE: idle line detected flag
      \arg        USART_FLAG_TC: transmission complete flag
      \arg        USART_FLAG_LBD: LIN break detected flag
      \arg        USART_FLAG_CTSF: CTS change flag
      \arg        USART_FLAG_RT: receiver timeout flag
      \arg        USART_FLAG_EB: end of block flag
      \arg        USART_FLAG_AM: address match flag
      \arg        USART_FLAG_WU: wakeup from deep-sleep mode flag
      \arg        USART_FLAG_EPERR: early parity error flag
    \param[out] none
    \retval     none
*/
void hals_smartcard_flag_clear(uint32_t smartcard_periph, usart_flag_enum flag)
{
    USART_INTC(smartcard_periph) |= BIT(USART_BIT_POS(flag));
}

/*!
    \brief      enable SMARTCARD interrupt
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  interrupt: interrupt
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_IDLE: idle line detected interrupt
      \arg        USART_INT_RBNE: read data buffer not empty interrupt and overrun error interrupt
      \arg        USART_INT_TC: transmission complete interrupt
      \arg        USART_INT_TBE: transmitter buffer empty interrupt
      \arg        USART_INT_PERR: parity error interrupt
      \arg        USART_INT_AM: address match interrupt
      \arg        USART_INT_RT: receiver timeout interrupt
      \arg        USART_INT_EB: end of block interrupt
      \arg        USART_INT_LBD: LIN break detection interrupt
      \arg        USART_INT_ERR: error interrupt
      \arg        USART_INT_CTS: CTS interrupt
      \arg        USART_INT_WU: wakeup from deep-sleep mode interrupt
      \arg        USART_INT_RFF: receive FIFO full interrupt
    \param[out] none
    \retval     none
*/
void hals_smartcard_interrupt_enable(uint32_t smartcard_periph, usart_interrupt_enum interrupt)
{
    USART_REG_VAL(smartcard_periph, interrupt) |= BIT(USART_BIT_POS(interrupt));
}

/*!
    \brief      disable SMARTCARD interrupt
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  interrupt: interrupt
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_IDLE: idle interrupt
      \arg        USART_INT_RBNE: read data buffer not empty interrupt and overrun error interrupt
      \arg        USART_INT_TC: transmission complete interrupt
      \arg        USART_INT_TBE: transmitter buffer empty interrupt
      \arg        USART_INT_PERR: parity error interrupt
      \arg        USART_INT_AM: address match interrupt
      \arg        USART_INT_RT: receiver timeout interrupt
      \arg        USART_INT_EB: end of block interrupt
      \arg        USART_INT_LBD: LIN break detection interrupt
      \arg        USART_INT_ERR: error interrupt
      \arg        USART_INT_CTS: CTS interrupt
      \arg        USART_INT_WU: wakeup from deep-sleep mode interrupt
      \arg        USART_INT_RFF: receive FIFO full interrupt
    \param[out] none
    \retval     none
*/
void hals_smartcard_interrupt_disable(uint32_t smartcard_periph, usart_interrupt_enum interrupt)
{
    USART_REG_VAL(smartcard_periph, interrupt) &= ~BIT(USART_BIT_POS(interrupt));
}

/*!
    \brief      get SMARTCARD interrupt flag status
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  int_flag: interrupt and flag type, refer to usart_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_FLAG_EB: end of block interrupt flag
      \arg        USART_INT_FLAG_RT: receiver timeout interrupt flag
      \arg        USART_INT_FLAG_AM: address match interrupt flag
      \arg        USART_INT_FLAG_PERR: parity error interrupt flag
      \arg        USART_INT_FLAG_TBE: transmitter buffer empty interrupt flag
      \arg        USART_INT_FLAG_TC: transmission complete interrupt flag
      \arg        USART_INT_FLAG_RBNE: read data buffer not empty interrupt flag
      \arg        USART_INT_FLAG_RBNE_ORERR: overrun error interrupt flag
      \arg        USART_INT_FLAG_IDLE: idle line detected interrupt flag
      \arg        USART_INT_FLAG_LBD: LIN break detected interrupt flag
      \arg        USART_INT_FLAG_WU: wakeup from deep-sleep mode interrupt flag
      \arg        USART_INT_FLAG_CTS: CTS interrupt flag
      \arg        USART_INT_FLAG_ERR_NERR: noise error interrupt flag
      \arg        USART_INT_FLAG_ERR_ORERR: overrun error interrupt flag
      \arg        USART_INT_FLAG_ERR_FERR: frame error interrupt flag
      \arg        USART_INT_FLAG_RFF: receive FIFO full interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus hals_smartcard_interrupt_flag_get(uint32_t smartcard_periph,
        usart_interrupt_flag_enum int_flag)
{
    uint32_t intenable = 0U, flagstatus = 0U;
    /* get the interrupt enable bit status */
    intenable = (USART_REG_VAL(smartcard_periph, int_flag) & BIT(USART_BIT_POS(int_flag)));
    /* get the corresponding flag bit status */
    flagstatus = (USART_REG_VAL2(smartcard_periph, int_flag) & BIT(USART_BIT_POS2(int_flag)));

    if(flagstatus && intenable) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear SMARTCARD interrupt flag
    \param[in]  smartcard_periph: USARTx(x=0,1)
    \param[in]  flag: SMARTCARD interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_FLAG_EB: end of block interrupt flag
      \arg        USART_INT_FLAG_RT: receiver timeout interrupt flag
      \arg        USART_INT_FLAG_AM: address match interrupt flag
      \arg        USART_INT_FLAG_PERR: parity error interrupt flag
      \arg        USART_INT_FLAG_TC: transmission complete interrupt flag
      \arg        USART_INT_FLAG_RBNE_ORERR: overrun error interrupt flag
      \arg        USART_INT_FLAG_IDLE: idle line detected interrupt flag
      \arg        USART_INT_FLAG_LBD: LIN break detected interrupt flag
      \arg        USART_INT_FLAG_WU: wakeup from deep-sleep mode interrupt flag
      \arg        USART_INT_FLAG_CTS: CTS change interrupt flag
      \arg        USART_INT_FLAG_ERR_FERR: frame error interrupt flag
      \arg        USART_INT_FLAG_ERR_NERR: noise detected interrupt flag
      \arg        USART_INT_FLAG_ERR_ORERR: overrun error interrupt flag
      \arg        USART_INT_FLAG_RFF: receive FIFO full interrupt flag
    \param[out] none
    \retval     none
*/
void hals_smartcard_interrupt_flag_clear(uint32_t smartcard_periph,
        usart_interrupt_flag_enum int_flag)
{
    if(USART_INT_FLAG_RFF == int_flag) {
        USART_RFCS(smartcard_periph) &= (uint32_t)(~USART_RFCS_RFFINT);
    } else {
        USART_INTC(smartcard_periph) |= BIT(USART_BIT_POS2(int_flag));
    }
}

/*!
    \brief      get smartcard error status
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error status: RESET or SET
*/
static FlagStatus _smartcard_error_flag_get(hal_smartcard_dev_struct *smartcard)
{
    if(0U == (USART_STAT(smartcard->periph) & (uint32_t)(USART_STAT_PERR | USART_STAT_FERR | \
              USART_STAT_ORERR | USART_STAT_NERR | USART_STAT_RTF))) {
        return RESET;
    } else {
        return SET;
    }
}

/*!
    \brief      smartcard transmit complete interrupt handler
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _smartcard_transmit_complete_interrupt(void *smartcard)
{
    hal_smartcard_dev_struct *p_smartcard = smartcard;
    hal_smartcard_user_cb p_func = (hal_smartcard_user_cb)p_smartcard->tx_callback;

    /* disable usart transmit complete interrupt */
    hals_smartcard_interrupt_disable(p_smartcard->periph, USART_INT_TC);

